using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using BgRallyRace.Data;
using BgRallyRace.Models;
using BgRallyRace.Models.RandomName;
using Microsoft.AspNetCore.Hosting;
using Microsoft.Extensions.Configuration;
using Microsoft.Extensions.Hosting;
using Microsoft.Extensions.Logging;

namespace BgRallyRace
{
    public class Program
    {
        public static void Main(string[] args)
        {
           // ApplicationDbContext db = new ApplicationDbContext();
           // First(db);
           // Secand(db);
           // db.SaveChanges();
            CreateHostBuilder(args).Build().Run();
        }

        public static IHostBuilder CreateHostBuilder(string[] args) =>
            Host.CreateDefaultBuilder(args)
                .ConfigureWebHostDefaults(webBuilder =>
                {
                    webBuilder.UseStartup<Startup>();
                });

        public static void First(ApplicationDbContext db)
        {
            string[] first = new string[]
           {
        "Адриан       ",
        "Александър   ",
        "Анатоли      ",
        "Ангел        ",
        "Андрей       ",
        "Антоан       ",
        "Асен         ",
        "Аспарух      ",
        "Атанас       ",
        "Бахар        ",
        "Бисер        ",
        "Благовест    ",
        "Благой       ",
        "Бойко        ",
        "Борислав     ",
        "Боян         ",
        "Браян        ",
        "Валентин     ",
        "Валери       ",
        "Ваньо        ",
        "Васко        ",
        "Велизар      ",
        "Велин        ",
        "Венцислав    ",
        "Веско        ",
        "Виктор       ",
        "Вилизар      ",
        "Владимир     ",
        "Георги       ",
        "Григор       ",
        "Гълъбин      ",
        "Дамян        ",
        "Дафин        ",
        "Дени         ",
        "Деян         ",
        "Димчо        ",
        "Добрен       ",
        "Драго        ",
        "Евгени       ",
        "Еленко       ",
        "Емил         ",
        "Желязко      ",
        "Захари       ",
        "Здравко      ",
        "Златко       ",
        "Ивайло       ",
        "Иван         ",
        "Илиян        ",
        "Илко         ",
        "Искрен       ",
        "Йордан       ",
        "Камен        ",
        "Кирил        ",
        "Костадин     ",
        "Костантин    ",
        "Красимир     ",
        "Кристин      ",
        "Кристян      ",
        "Крум         ",
        "Кубрат       ",
        "Лазар        ",
        "Людмил       ",
        "Малин        ",
        "Мануил       ",
        "Марио        ",
        "Мартин       ",
        "Михаил       ",
        "Найден       ",
        "Неделчо      ",
        "Недялко      ",
        "Никифор      ",
        "Николай      ",
        "Огнян        ",
        "Орлин        ",
        "Павел        ",
        "Пенко        ",
        "Петко        ",
        "Петър        ",
        "Ради         ",
        "Радослав     ",
        "Райко        ",
        "Румен        ",
        "Сашко        ",
        "Симеон       ",
        "Славейко     ",
        "Станачко     ",
        "Стилиян      ",
        "Теодор       ",
        "Теодоси      ",
        "Теофил       ",
        "Тихомир      ",
        "Траян        ",
        "Филип        ",
        "Христо       ",
        "Христомир    ",
        "Цветан       ",
        "Чавдар       ",
        "Шишман       ",
        "Юлиан        ",
        "Явор         ",
        "Яким         ",
        "Ясен         "

           };

            for (int i = 0; i < first.Length; i++)
            {
                db.FirstNames.Add(new FirstNames { FirstName = first[i].Trim() });
            }
            
        }

        public static void Secand(ApplicationDbContext db)
        {
            string[] first = new string[]
          {
            "Аврамов       ",
            "Андреев       ",
            "Арабаджиев    ",
            "Арнаудов      ",
            "Асенов        ",
            "Атанасов      ",
            "Божинов       ",
            "Борисов       ",
            "Бояджиев      ",
            "Бисеров       ",
            "Ванчев        ",
            "Вачков        ",
            "Велешки       ",
            "Велчев        ",
            "Виденов       ",
            "Вълчанов      ",
            "Вълчев        ",
            "Георгиев      ",
            "Герасимов     ",
            "Гоцев         ",
            "Гошев         ",
            "Григориев     ",
            "Григоров      ",
            "Груев         ",
            "Грънчаров     ",
            "Гълъбов       ",
            "Дамянов       ",
            "Дерменджиев   ",
            "Димитров      ",
            "Добрев        ",
            "Драганов      ",
            "Дюлгеров      ",
            "Дянков        ",
            "Желев         ",
            "Жендов        ",
            "Живков        ",
            "Иванов        ",
            "Ивков         ",
            "Игнатов       ",
            "Измирлиев     ",
            "Инджов        ",
            "Йорданов      ",
            "Йосифов       ",
            "Каменов       ",
            "Кантарджиев   ",
            "Каравелов     ",
            "Караджов      ",
            "Карастоянов   ",
            "Касабов       ",
            "Ковачев       ",
            "Котев         ",
            "Кръстев       ",
            "Константинов  ",
            "Кънев         ",
            "Мавродиев     ",
            "Маринов       ",
            "Минков        ",
            "Минчев        ",
            "Митев         ",
            "Митов         ",
            "Михайлов      ",
            "Михайловски   ",
            "Михов         ",
            "Младенов      ",
            "Николов       ",
            "Неделчев      ",
            "Ненчев        ",
            "Обрешков      ",
            "Панайотов     ",
            "Петков        ",
            "Петров        ",
            "Плачков       ",
            "Попов         ",
            "Първанов      ",
            "Радев         ",
            "Радославов    ",
            "Русев         ",
            "Семерджиев    ",
            "Симеонов      ",
            "Спасов        ",
            "Ставрев       ",
            "Станев        ",
            "Стойков       ",
            "Стоянов       ",
            "Танев         ",
            "Тодоров       ",
            "Томов         ",
            "Тончев        ",
            "Тошев         ",
            "Трифонов      ",
            "Хаджиев       ",
            "Христов       ",
            "Цветанов      ",
            "Цветков       ",
            "Цеков         ",
            "Чакъров       ",
            "Червенков     ",
            "Чешмеджиев    ",
            "Шейтанов      ",
            "Яворов        "

          };

            for (int i = 0; i < first.Length; i++)
            {
                db.LastNames.Add(new LastNames { LastName = first[i].Trim() });
            }
        }
    }
}
